Repository: D0M1N1Kx/Vehicle-Cost-Tracker
Catalog: lib/l10n/app_*.arb
Languages: de, hu, ru, sr

# appTitle
source: Vehicle Cost Tracker
de: Fahrzeugkostenverfolgung
hu: Járműköltség Követő
ru: Отслеживание Расходов Автомобиля
sr: Praćenje Troškova Vozila

source: Garage
hu: Garázs
ru: Гараж
sr: Garaža

# garageSub
source: Managing and modifying your cars
de: Verwaltung und Modifizierung von Fahrzeugen
hu: Autók kezelése és változtatása
ru: Управление и изменение ваших автомобилей
sr: Upravljanje i izmena vaših automobila

source: Maintenance reminder
de: Wartungserinnerung
hu: Karbantartás emlékeztető
ru: Напоминание о техническом обслуживании
sr: Podsetnik za održavanje

# maintenanceSub
source: Recorded statuses and due dates
de: Aufgezeichnete Zustände und Fristen
hu: Rögzített állapotok és határidők
ru: Записанные статусы и сроки
sr: Zabeleženi statusi i rokovi

# noVehFound
source: No vehicles found. Please add a vehicle first.
de: Keine Fahrzeuge gefunden. Bitte fügen Sie zuerst ein Fahrzeug hinzu.
hu: Nem található jármű. Kérjük, először adjon hozzá egy járművet.
ru: Автомобили не найдены. Сначала добавьте автомобиль.
sr: Nisu pronađena vozila. Molimo prvo dodajte vozilo.

source: Refueling Log
de: Tankprotokoll
hu: Tankolás Napló
ru: Журнал заправок
sr: Dnevnik Punjenja Goriva

# refuelingSub
source: Tracking monthly fuel costs
de: Monatliche Kraftstoffkosten verfolgen
hu: Havi üzemanyagköltségek nyomon követése
ru: Отслеживание ежемесячных расходов на топливо
sr: Praćenje mesečnih troškova goriva

source: Service Log
de: Wartungsprotokoll
hu: Szervíz Napló
ru: Журнал обслуживания
sr: Dnevnik Servisa

# serviceSub
source: Repairs carried out and their costs
de: Durchgeführte Reparaturen und deren Kosten
hu: Az elvégzett javítások és azok költségei
ru: Выполненные ремонты и их стоимость
sr: Izvršeni popravci i njihovi troškovi

source: Monthly Cost
de: Monatliche Kosten
hu: Havi Költség
ru: Ежемесячные расходы
sr: Mesečni Trošak

source: Total Cost
de: Gesamtkosten
hu: Összes Költség
ru: Общая стоимость
sr: Ukupan Trošak

source: Fuel Quantity
de: Kraftstoffmenge
hu: Üzemanyag Mennyiség
ru: Количество топлива
sr: Količina Goriva

source: Settings
de: Einstellungen
hu: Beállítások
ru: Настройки
sr: Podešavanja

# settingsSub
source: Languages, currency, units and other options
de: Sprachen, Währung, Einheiten und weitere Optionen
hu: Nyelvek, pénznem, mértékegységek és egyéb beállítások
ru: Языки, валюта, единицы измерения и другие опции
sr: Jezici, valuta, jedinice i ostale opcije

# unit
source: km
ru: км

# fuelUnit
source: L
ru: л

source: Add Vehicle
de: Fahrzeug hinzufügen
hu: Jármű hozzáadása
ru: Добавить автомобиль
sr: Dodaj Vozilo

source: Brand
de: Marke
hu: Márka
ru: Марка
sr: Marka

# brandErr
source: Please select a brand
de: Bitte wählen Sie eine Marke
hu: Kérlek válassz egy márkát
ru: Пожалуйста, выберите марку
sr: Molimo izaberite marku

source: Modell
ru: Модель
sr: Model

# modellErr
source: Please enter a model name
de: Bitte geben Sie einen Modellnamen ein
hu: Kérlek írj be egy modell nevet
ru: Пожалуйста, введите название модели
sr: Molimo unesite naziv modela

source: Engine type
de: Motortyp
hu: Motor típusa
ru: Тип двигателя
sr: Tip motora

# engineTypeErr
source: Please enter engine type
de: Bitte geben Sie den Motortyp ein
hu: Kérlek írd be a motor típusát
ru: Пожалуйста, введите тип двигателя
sr: Molimo unesite tip motora

source: Color
de: Farbe
hu: Szín
ru: Цвет
sr: Boja

# colorErr
source: Please enter color
de: Bitte geben Sie eine Farbe ein
hu: Kérlek írj be egy színt
ru: Пожалуйста, введите цвет
sr: Molimo unesite boju

source: Year
de: Jahrgang
hu: Évjárat
ru: Год
sr: Godina

# yearErr
source: Please enter a year
de: Bitte geben Sie das Jahr ein
hu: Kérlek add meg az évjáratot
ru: Пожалуйста, введите год
sr: Molimo unesite godinu

# yearErrValid
source: Year must be a valid number
de: Das Jahr muss eine gültige Zahl sein
hu: Az évjáratnak egész számnak kell lennie
ru: Год должен быть действительным числом
sr: Godina mora biti validan broj

# odometer
source: Odometer reading
de: Kilometerzähler
hu: Kilóméter óra állása
ru: Показания одометра
sr: Očitavanje broja kilometara

# odometerErr
source: Please enter odometer reading
de: Bitte geben Sie den Kilometerzähler ein
hu: Kérlek add meg a kilóméter óra állását
ru: Пожалуйста, введите показания одометра
sr: Molimo unesite očitavanje broja kilometara

# odometerErrValid
source: Odometer must be a valid number
de: Der Kilometerzähler muss eine gültige Zahl sein
hu: Kilóméter óra állása egész számnak kell lennie
ru: Показания одометра должны быть действительным числом
sr: Broj kilometara mora biti validan broj

source: License plate
de: Kennzeichen
hu: Rendszám tábla
ru: Номерной знак
sr: Registarska tablica

# licensePlateErr
source: Please enter license plate
de: Bitte geben Sie das Kennzeichen ein
hu: Kérlek írd be a rendszám táblát
ru: Пожалуйста, введите номерной знак
sr: Molimo unesite registarsku tablicu

# chassisNumber
source: Chassis number (optional)
de: Fahrgestellnummer (optional)
hu: Vázszám (opcionális)
ru: Номер кузова (опционально)
sr: Broj šasije (opciono)

source: Save
de: Speichern
hu: Mentés
ru: Сохранить
sr: Sačuvaj

# fuelQuantityErr
source: Please enter fuel quantity
de: Bitte geben Sie die Kraftstoffmenge ein
hu: Kérjük, adja meg az üzemanyag mennyiségét
ru: Пожалуйста, введите количество топлива
sr: Molimo unesite količinu goriva

# fuelPriceErr
source: Please enter fuel price
de: Bitte geben Sie den Kraftstoffpreis ein
hu: Kérjük, adja meg az üzemanyag árát
ru: Пожалуйста, введите цену топлива
sr: Molimo unesite cenu goriva

# fuelQuantityErrValid
source: Quantity must be a valid number
de: Die Menge muss eine gültige Zahl sein
hu: A mennyiségnek érvényes számnak kell lennie.
ru: Количество должно быть действительным числом
sr: Količina mora biti validan broj

# fuelPriceErrValid
source: Price must be a valid number
de: Der Preis muss eine gültige Zahl sein
hu: Az árnak érvényes számnak kell lennie.
ru: Цена должна быть действительным числом
sr: Cena mora biti validan broj

# fuelQuantityErrGreater
source: Quantity must be greater than 0
de: Die Menge muss größer als 0 sein
hu: A mennyiségnek nagyobbnak kell lennie, mint 0
ru: Количество должно быть больше 0
sr: Količina mora biti veća od 0

# fuelPriceErrGreater
source: Price must be greater than 0
de: Der Preis muss größer als 0 sein
hu: Az árnak nagyobbnak kell lennie, mint 0
ru: Цена должна быть больше 0
sr: Cena mora biti veća od 0

source: Refuel saved!
de: Betankung gespeichert!
hu: Tankolás elmentve!
ru: Заправка сохранена!
sr: Punjenje sačuvano!

source: Refueling
de: Betankung
hu: Tankolás
ru: Заправка
sr: Punjenje

source: Avg Per Fill
de: Durchschnitt pro Tankstelle
hu: Átlagos ár tankolásonként
ru: Средняя заправка
sr: Prosek po Punjenju

source: Monthly Liters
de: Monatliche Liter
hu: Havi liter
ru: Ежемесячные литры
sr: Mesečni Litri

source: New refuel log
de: Neues Tankprotokoll
hu: Új tankolási napló
ru: Новая заправка
sr: Novo punjenje goriva

source: Fuel Price
de: Kraftstoffpreis (Währung / Liter)
hu: Üzemanyagár
ru: Цена топлива
sr: Cena Goriva

source: Fuel Cost
de: Kraftstoffkosten
hu: Üzemanyagköltség
ru: Стоимость топлива
sr: Trošak Goriva

source: No refuels in this month
de: Keine Tankungen in diesem Monat
hu: Nincs tankolás ebben a hónapban
ru: Нет заправок в этом месяце
sr: Nema punjenja u ovom mesecu

source: Refuels this month
de: Tankungen in diesem Monat
hu: Tankolás ebben a hónapban
ru: Заправки в этом месяце
sr: Punjenja u ovom mesecu

source: All services
de: Alle Wartungen
hu: Összes szervíz
ru: Все обслуживания
sr: Svi servisi

source: All costs
de: Alle Kosten
hu: Összes költség
ru: Все расходы
sr: Svi troškovi

source: New service log
de: Neue Wartung
hu: Új szervíz
ru: Новое обслуживание
sr: Novi servis

# noServicesOrRefuels
source: No services or refuels recorded
de: Keine Wartungen oder Tankungen erfasst
hu: Nincsen szervíz vagy tankolás feljegyezve
ru: Обслуживание или заправка не записаны
sr: Nije zabeležen servis ili punjenje

source: Service Type
de: Wartungstyp
hu: Szervíz típusa
ru: Тип обслуживания
sr: Tip Servisa

# serviceTypeErr
source: Please select a service type
de: Bitte wählen Sie einen Wartungstyp
hu: Kérlek válassz egy szervíz típust
ru: Пожалуйста, выберите тип обслуживания
sr: Molimo izaberite tip servisa

source: Cost
de: Kosten
hu: Költség
ru: Стоимость
sr: Trošak

# costErr
source: Please enter a cost
de: Bitte geben Sie die Kosten ein
hu: Kérlek adj meg egy költséget
ru: Пожалуйста, введите стоимость
sr: Molimo unesite trošak

# costErrValid
source: Cost must be a valid number
de: Die Kosten müssen eine ganze Zahl sein
hu: Költségnek egész számnak kell lennie
ru: Стоимость должна быть действительным числом
sr: Trošak mora biti validan broj

source: Cancel
de: Abbrechen
hu: Mégse
ru: Отмена
sr: Otkaži

source: Add Service
de: Wartung hinzufügen
hu: Szerviz hozzáadása
ru: Добавить обслуживание
sr: Dodaj Servis

# emptyGarage
source: Your garage is empty
de: Deine Garage ist noch leer
hu: A garazsad még üres
ru: Ваш гараж пуст
sr: Vaša garaža je prazna

# addANewVehicle
source: Add a new vehicle to start keeping a maintenance log
de: Füge deiner Garage ein neues Auto hinzu, um mit der Führung eines Protokolls zu beginnen!
hu: Adj a garazsadhoz új autót, hogy elkezdhess naplót vezetni!
ru: Добавьте новый автомобиль, чтобы начать вести журнал обслуживания
sr: Dodajte novo vozilo da počnete da čuvate dnevnik održavanja

source: Select Vehicle
de: Fahrzeug auswählen
hu: Válassz autót
ru: Выберите автомобиль
sr: Izaberite Vozilo

source: Language
de: Sprache
hu: Nyelv
ru: Язык
sr: Jezik

# currencyLabel
source: Currency
de: Währung
hu: Pénznem
ru: Валюта
sr: Valuta

source: Distance unit
de: Entfernungseinheit
hu: Távolsági mértékegység
ru: Единица расстояния
sr: Jedinica rastojanja

source: kilometers
de: Kilometer
hu: Kilométer
ru: километры
sr: kilometri

source: miles
de: Meilen
hu: Mérföld
ru: мили
sr: milje

# fuelUnitLabel
source: Fuel unit
de: Kraftstoffeinheit
hu: Üzemanyag mértékegység
ru: Единица топлива
sr: Jedinica goriva

source: liters
de: Liter
hu: Liter
ru: литры
sr: litri

source: gallons
de: Gallonen
hu: Gallon
ru: галлоны
sr: galoni

source: Quick presets
de: Schnelleinstellungen
hu: Gyors beállítások
ru: Быстрые предустановки
sr: Brze presets

# noServices
source: No services have been recorded yet
hu: Még nem lett szerviz rögzítve
ru: Обслуживание еще не записано
sr: Nema zabeleženih servisa

source: Maintenance Schedule
hu: Karbantartási ütemezés
ru: График обслуживания
sr: Raspored održavanja

source: Overdue
hu: Lejárt
ru: Просрочено
sr: Isteklo

source: Upcoming
hu: Közelgő
ru: Предстоящее
sr: Predstoji

source: OK
ru: ОК

source: Last
hu: Utolsó
ru: Последнее
sr: Poslednja

source: remaining
hu: maradt
ru: осталось
sr: preostaje

source: Next at
hu: Következő
ru: Следующее
sr: Sledeće

source: days remaining
hu: nap maradt
ru: дней осталось
sr: dana preostaje

source: Every
hu: Minden
ru: Каждые
sr: Svakih
